{
    "nav_contact": "Kontakt",
    "nav_projects": "Projekte",
    "nav_about": "Über mich",
    "header_title": "Hey<br />ich bin Leonid",
    "projects_title": "Projekte",
    "contact_title": "Kontakt",
    "contact_vorname_label": "Vorname",
    "contact_nachname_label": "Nachname",
    "contact_email_label": "E-Mail",
    "contact_message_label": "Nachricht",
    "contact_submit_button": "Absenden",
<<<<<<< HEAD
    "contact_info_title": "Lass uns &uuml;ber <span>Projekte</span> sprechen.",
=======
    "contact_info_title": "Lass uns &#252;ber <span>Projekte</span> sprechen.",
>>>>>>> 2a6c8c00c5247e3048944a6c0371dc1100f48198
    "contact_info_text": "Ich bin gespannt auf deine Ideen und freue mich darauf, mit dir zusammenzuarbeiten. Schreib mir einfach eine Nachricht und ich melde mich bei dir.",
    "about_title": "Über mich",
    "about_headline": "Über mich",
    "about_intro": "Moin! Ich bin ein passionierter Programmierer aus Flensburg im Norden Deutschlands. Mein Wissen in der Softwareentwicklung habe ich durch kontinuierliches Engagement, praktische Erfahrungen und mein Studium der <span>Medieninformatik</span> an der Hochschule Flensburg erworben.",
    "about_study_field": "Medieninformatik",
    "about_passion": "Ich habe eine besondere Leidenschaft für die Entwicklung von Webanwendungen, insbesondere im Bereich <span>UI/UX Design</span> und <span>Webentwicklung</span>. Mir ist es wichtig, dass Lösungen nicht nur funktional, sondern auch benutzerfreundlich sind. Innovation und Benutzerfreundlichkeit sind meine ständige Motivation.",
    "about_ui_ux": "UI/UX Design",
    "about_web_dev": "Webentwicklung",
    "about_skills": "Ich halte mich stets über die neuesten Technologien auf dem Laufenden, um sicherzustellen, dass meine Fähigkeiten den aktuellen Anforderungen entsprechen. Wenn du einen versierten Entwickler suchst, der herausragende Ergebnisse erzielt, stehe ich gerne zur Verfügung.",
    "about_collaboration": "Lass uns gemeinsam an spannenden Projekten arbeiten und großartige digitale Erlebnisse schaffen. Kontaktiere mich, um mehr über meine Arbeit und wie ich dir helfen kann, zu erfahren.",
    "capabilities_headline": "Meine Fähigkeiten",
    "capabilities_languages_headline": "Sprachen",
    "language_german": "Deutsch",
    "language_russian": "Russisch",
    "language_ukrainian": "Ukrainisch",
    "language_english": "Englisch",
    "level_c2": "C2",
    "level_native": "Muttersprache",
    "level_b1": "B1",
    "capabilities_programming_languages_headline": "Programmiersprachen",
    "language_javascript": "JavaScript",
    "language_java": "Java",
    "language_kotlin": "Kotlin",
    "language_python": "Python",
    "level_proficient": "Kompetent",
    "level_advanced": "Fortgeschritten",
    "level_beginner": "Anfänger",
    "capabilities_web_dev_headline": "Webentwicklung",
    "language_react": "React",
    "language_nodejs": "Node.js",
    "language_deno": "Deno",
    "capabilities_design_headline": "Design",
    "language_webdesign": "Web Design",
    "language_uidesign": "UI Design",
    "social_telegram": "Link zu meinem Telegram-Kanal.",
    "social_discord": "Link zu meinem Discord-Server.",
    "social_dribbble": "Link zu meinem Dribbble-Profil.",
    "social_github": "Link zu meinem GitHub-Repository.",
    "social_linkedin": "Link zu meinem LinkedIn-Profil.",
    "legal_imprint": "Impressum",
    "legal_privacy": "Datenschutz",
    "legal_documentation": "Dokumentation",
    "legal_colophon": "Kolophon",
    "legal_timeline": "Zeitleiste",
    "project_name_dance_academy": "Angela's Dance Academy",
    "project_description_dance_academy": "Visuelle Identität, Branding, Logotype, Webseite",
    "project_text_dance_academy": "Im Rahmen dieses Projekts habe ich meine Fähigkeiten in HTML und CSS genutzt, um eine dynamische und ansprechende Webseite für Angela's Dance Academy zu entwickeln. Die Webseite ist darauf ausgelegt, die Begeisterung und das Talent für Tanz in einer einzigartigen Weise zu präsentieren.",
    "project_keywords_dance_academy": "HTML, CSS, Responsive Design",
    "project_images_heading": "Bilder Galerie",
    "project_thumbnail_alt_dance_academy": "Header der Angela's Dance Academy-Website mit dem Logo der Academy und Kontaktinformationen. Die Adresse lautet 12840 Tamiami Trail North Suite 300, Naples, FL, 34110, und die Telefonnummer ist 239.215.2888.",
    "project_gif_alt_dance_academy": "GIF der Angela's Dance Academy-Website, das die Seite von oben nach unten scrollt und verschiedene Abschnitte zeigt.",
    "project_logo_alt_dance_academy": "Logo der Angela's Dance Academy mit einem stilisierten Buchstaben 'A' und dem Text 'Angela's Dance Academy' daneben.",
    "project_mobile_screenshot_alt_dance_academy": "Screenshot der Angela's Dance Academy-Website auf einem Smartphone. Die mobile Ansicht zeigt die Startseite mit einem Bild von tanzenden Kindern und einer kurzen Beschreibung darunter.",
    "project_desktop_screenshot_alt_dance_academy": "Screenshot der Angela's Dance Academy-Website auf einem Laptop. Die Desktop-Ansicht zeigt die Seite mit den Kursangeboten, einschließlich Bildern von tanzenden Kindern und Kursbeschreibungen.",
    "project_name_audiventure": "Audiventure",
    "project_description_audiventure": "Visuelle Identität, Branding, Logo des Click-Dummys",
    "project_text_audiventure": "Ein interaktiver Click-Dummy für einen Hörspiel-Player, der im Rahmen eines Hochschulprojekts im Modul „Interface und Interaktionsdesign“ an der Hochschule Flensburg entwickelt wurde. Der Click-Dummy wurde als visuelles Konzept erstellt, das die Benutzeroberfläche und die Interaktion mit dem Player vermittelt.",
    "project_keywords_audiventure": "UX, UI, Figma, Design Thinking",
    "project_thumbnail_alt_audiventure": "Screenshot der Audiventure-App, der alle Frames der App zeigt, einschließlich Startseite, Suchseite, Bibliotheksansicht, Trophäenansicht, Detailseiten von Büchern, Einstellungen und Zahlungsoptionen. Die App-Frames sind auf einem Smartphone-Display dargestellt und geben einen umfassenden Überblick über das Design und die Funktionen der App.",
    "project_gif_alt_audiventure": "Screenshot der Audiventure-App, der ein Karussell zeigt, das von links nach rechts läuft und verschiedene Screens der App darstellt. Zu sehen sind die Startseite, Suchseite, Bibliotheksansicht, Trophäenansicht, Detailseiten von Büchern, Einstellungen und Zahlungsoptionen. Die App-Frames sind auf einem Smartphone-Display dargestellt und geben einen umfassenden Überblick über das Design und die Funktionen der App.",
    "project_detail_alt_audiventure": "Screenshot der Audiventure-App, die die Detailansicht des Audio-Players auf einem Smartphone zeigt. Es wird das Buch 'Hobbit' von Ed Strauss angezeigt. Oben ist das Buchcover zu sehen, darunter der Titel, der Autor und ein kurzer Beschreibungstext. Rechts unten befindet sich eine Play-Taste.",
    "project_search_alt_audiventure": "Screenshot der Audiventure-App Suchseite auf einem Smartphone. Oben befindet sich eine Suchleiste mit dem Text 'Suche'. Darunter sind mehrere Buchcover in einem Gitterlayout zu sehen. Jedes Buchcover hat einen Titel darunter. Die App-Oberfläche ist dunkel mit weißem Text.",
    "project_home_alt_audiventure": "Screenshot der Audiventure-App Startseite auf einem Smartphone, die ein großes, pinkfarbenes Banner mit dem App-Namen 'Audiventure' zeigt. Darunter steht der Slogan 'Wo gelesenes zum Alltag wird, und Geschichten zum Leben erwachen'. Am unteren Rand befindet sich ein rosa Button mit dem Text 'Los geht's!'",
    "project_name_pw_generator": "Password Generator",
    "project_description_pw_generator": "Webseite",
    "project_text_pw_generator": "Der Password Generator ermöglicht die Erstellung sicherer Passwörter durch die Auswahl von Länge und verschiedenen Zeichenarten. Nutzer können die gewünschten Einstellungen auswählen und ein starkes Passwort generieren. Die Webseite wurde mit HTML, CSS und JavaScript entwickelt.",
    "project_keywords_pw_generator": "HTML, CSS, JavaScript",
    "project_image_alt_pw_generator": "Ein Clip des Password Generators in Aktion im Webbrowser",
    "project_name_photography_masterclass": "Photography Masterclass",
    "project_description_photography_masterclass": "CSS/SCSS Kurs",
    "project_text_photography_masterclass": "In dem Kurs „Fortgeschrittenes CSS: Moderne Techniken für Webseiten“ habe ich meine Kenntnisse in HTML und CSS erweitert. Der Kurs bot eine praxisorientierte Einführung in moderne CSS3-Features, die die Entwicklung interaktiver Webseiten ermöglichen.",
    "project_keywords_photography_masterclass": "Responsive Design, Gradients, Animationen, BEM, Flexbox, Grid, SCSS",
    "project_thumbnail_alt_photography_masterclass": "Screenshot der Fotografie-Touren-Website mit dem Titel 'Unsere Fotografie-Touren'. Zu sehen sind fünf verschiedene Tourangebote: 'Tour durch die Wüste' in Bateen Liwa, UAE, 'Drohnen-Fotografie' in Porvoo, Finnland, 'Bergsteiger-Touren' in Montreal, Kanada, 'Eiswanderungen' in Nuuk, Grönland, und 'Polarbären-Fotografie' in der Antarktis. Jedes Angebot hat ein Bild und eine kurze Beschreibung des Ortes.",
    "project_frame1_alt_photography_masterclass": "Screenshot der Photography Masterclass-Website auf einem Laptop. Die Startseite zeigt ein großes Hintergrundbild einer Landschaft mit dem Titel 'Photography Masterclass' und dem Untertitel 'Master Landscape Photography in 10 Days'.",
    "project_frame2_alt_photography_masterclass": "Screenshot der Photography Masterclass-Website, der drei Kursangebote zeigt: 'Landschafts-Schnellkurs', 'Porträt-Grundkurs' und 'Porträt-Profikurs'. Jedes Angebot hat ein Bild, eine kurze Beschreibung, die Dauer und den Preis.",
    "project_frame3_alt_photography_masterclass": "Screenshot der Photography Masterclass-Website, der verschiedene Bilder von Landschaften zeigt. Der Text daneben beschreibt die Vorteile des Landschaftsfotografiekurses.",
    "project_frame4_alt_photography_masterclass": "Screenshot der Photography Masterclass-Website auf einem Smartphone. Die mobile Ansicht zeigt die Startseite mit dem Titel 'Photography Masterclass' und dem Untertitel 'Master Landscape Photography in 10 Days'. Darunter befindet sich eine Beschreibung des Kurses.",
    "imprint_title": "Impressum",
    "imprint_contact": "Kontakt",
    "privacy_policy_title": "Datenschutzerklärung",
    "privacy_policy_overview_title": "1. Datenschutz auf einen Blick",
    "privacy_policy_general_info_title": "Allgemeine Hinweise",
    "privacy_policy_general_info_text": "Die folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung.",
    "privacy_policy_data_collection_title": "Datenerfassung auf dieser Website",
    "privacy_policy_responsible_title": "Wer ist verantwortlich für die Datenerfassung auf dieser Website?",
    "privacy_policy_responsible_text": "Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten können Sie dem Abschnitt „Hinweis zur Verantwortlichen Stelle“ in dieser Datenschutzerklärung entnehmen.",
    "privacy_policy_how_collect_title": "Wie erfassen wir Ihre Daten?",
    "privacy_policy_how_collect_text1": "Ihre Daten werden zum einen dadurch erhoben, dass Sie uns diese mitteilen. Hierbei kann es sich z. B. um Daten handeln, die Sie in ein Kontaktformular eingeben.",
    "privacy_policy_how_collect_text2": "Andere Daten werden automatisch oder nach Ihrer Einwilligung beim Besuch der Website durch unsere IT-Systeme erfasst. Das sind vor allem technische Daten (z. B. Internetbrowser, Betriebssystem oder Uhrzeit des Seitenaufrufs). Die Erfassung dieser Daten erfolgt automatisch, sobald Sie diese Website betreten.",
    "privacy_policy_use_data_title": "Wofür nutzen wir Ihre Daten?",
    "privacy_policy_use_data_text": "Ein Teil der Daten wird erhoben, um eine fehlerfreie Bereitstellung der Website zu gewährleisten. Andere Daten können zur Analyse Ihres Nutzerverhaltens verwendet werden.",
    "privacy_policy_rights_title": "Welche Rechte haben Sie bezüglich Ihrer Daten?",
    "privacy_policy_rights_text1": "Sie haben jederzeit das Recht, unentgeltlich Auskunft über Herkunft, Empfänger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben außerdem ein Recht, die Berichtigung oder Löschung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, können Sie diese Einwilligung jederzeit für die Zukunft widerrufen. Außerdem haben Sie das Recht, unter bestimmten Umständen die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zuständigen Aufsichtsbehörde zu.",
    "privacy_policy_rights_text2": "Hierzu sowie zu weiteren Fragen zum Thema Datenschutz können Sie sich jederzeit an uns wenden.",
    "privacy_policy_hosting_title": "2. Hosting",
    "privacy_policy_hosting_text": "Wir hosten die Inhalte unserer Website bei folgendem Anbieter:",
    "privacy_policy_provider_title": "Strato",
    "privacy_policy_provider_text1": "Anbieter ist die Strato AG, Otto-Ostrowski-Straße 7, 10249 Berlin (nachfolgend „Strato“). Wenn Sie unsere Website besuchen, erfasst Strato verschiedene Logfiles inklusive Ihrer IP-Adressen.",
    "privacy_policy_provider_text2": "Weitere Informationen entnehmen Sie der Datenschutzerklärung von Strato: <a href=\"https://www.strato.de/datenschutz/\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.strato.de/datenschutz/</a>.",
    "privacy_policy_provider_text3": "Die Verwendung von Strato erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Wir haben ein berechtigtes Interesse an einer möglichst zuverlässigen Darstellung unserer Website. Sofern eine entsprechende Einwilligung abgefragt wurde, erfolgt die Verarbeitung ausschließlich auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO und § 25 Abs. 1 TDDDG, soweit die Einwilligung die Speicherung von Cookies oder den Zugriff auf Informationen im Endgerät des Nutzers (z. B. Device-Fingerprinting) im Sinne des TDDDG umfasst. Die Einwilligung ist jederzeit widerrufbar.",
    "privacy_policy_general_info2_title": "3. Allgemeine Hinweise und Pflichtinformationen",
    "privacy_policy_data_protection_title": "Datenschutz",
    "privacy_policy_data_protection_text1": "Die Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung.",
    "privacy_policy_data_protection_text2": "Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie persönlich identifiziert werden können. Die vorliegende Datenschutzerklärung erläutert, welche Daten wir erheben und wofür wir sie nutzen. Sie erläutert auch, wie und zu welchem Zweck das geschieht.",
    "privacy_policy_data_protection_text3": "Wir weisen darauf hin, dass die Datenübertragung im Internet (z. B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich.",
    "privacy_policy_responsible_info_title": "Hinweis zur verantwortlichen Stelle",
    "privacy_policy_responsible_info_text1": "Die verantwortliche Stelle für die Datenverarbeitung auf dieser Website ist:",
    "privacy_policy_address": "Leonid Domahalskyy<br />Rude 13<br />24941 Flensburg<br />Telefon: 015205892880<br />E-Mail: <a href=\"mailto:leonid.domagalsky@gmail.com\">leonid.domagalsky@gmail.com</a>",
    "privacy_policy_responsible_info_text2": "Verantwortliche Stelle ist die natürliche oder juristische Person, die allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung von personenbezogenen Daten (z. B. Namen, E-Mail-Adressen o. Ä.) entscheidet.",
    "privacy_policy_storage_duration_title": "Speicherdauer",
    "privacy_policy_storage_duration_text": "Soweit innerhalb dieser Datenschutzerklärung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck für die Datenverarbeitung entfällt. Wenn Sie ein berechtigtes Löschersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung widerrufen, werden Ihre Daten gelöscht, sofern wir keine anderen rechtlich zulässigen Gründe für die Speicherung Ihrer personenbezogenen Daten haben (z. B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im letztgenannten Fall erfolgt die Löschung nach Fortfall dieser Gründe.",
    "privacy_policy_legal_basis_title": "Allgemeine Hinweise zu den Rechtsgrundlagen der Datenverarbeitung auf dieser Website",
    "privacy_policy_legal_basis_text": "Sofern Sie in die Datenverarbeitung eingewilligt haben, verarbeiten wir Ihre personenbezogenen Daten auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO bzw. Art. 9 Abs. 2 lit. a DSGVO, sofern besondere Datenkategorien nach Art. 9 Abs. 1 DSGVO verarbeitet werden. Im Falle einer ausdrücklichen Einwilligung in die Übertragung personenbezogener Daten in Drittstaaten erfolgt die Datenverarbeitung außerdem auf Grundlage von Art. 49 Abs. 1 lit. a DSGVO. Sofern Sie in die Speicherung von Cookies oder in den Zugriff auf Informationen in Ihr Endgerät (z. B. via Device-Fingerprinting) eingewilligt haben, erfolgt die Datenverarbeitung zusätzlich auf Grundlage von § 25 Abs. 1 TDDDG. Die Einwilligung ist jederzeit widerrufbar. Sind Ihre Daten zur Vertragserfüllung oder zur Durchführung vorvertraglicher Maßnahmen erforderlich, verarbeiten wir Ihre Daten auf Grundlage des Art. 6 Abs. 1 lit. b DSGVO. Des Weiteren verarbeiten wir Ihre Daten, sofern diese zur Erfüllung einer rechtlichen Verpflichtung erforderlich sind auf Grundlage von Art. 6 Abs. 1 lit. c DSGVO. Die Datenverarbeitung kann ferner auf Grundlage unseres berechtigten Interesses nach Art. 6 Abs. 1 lit. f DSGVO erfolgen. Über die jeweils im Einzelfall einschlägigen Rechtsgrundlagen wird in den folgenden Absätzen dieser Datenschutzerklärung informiert.",
    "privacy_policy_recipients_title": "Empfänger von personenbezogenen Daten",
    "privacy_policy_recipients_text": "Im Rahmen unserer Geschäftstätigkeit arbeiten wir mit verschiedenen externen Stellen zusammen. Dabei ist teilweise auch eine Übermittlung von personenbezogenen Daten an diese externen Stellen erforderlich. Wir geben personenbezogene Daten nur dann an externe Stellen weiter, wenn dies im Rahmen einer Vertragserfüllung erforderlich ist, wenn wir gesetzlich hierzu verpflichtet sind (z. B. Weitergabe von Daten an Steuerbehörden), wenn wir ein berechtigtes Interesse nach Art. 6 Abs. 1 lit. f DSGVO an der Weitergabe haben oder wenn eine sonstige Rechtsgrundlage die Datenweitergabe erlaubt. Beim Einsatz von Auftragsverarbeitern geben wir personenbezogene Daten unserer Kunden nur auf Grundlage eines gültigen Vertrags über Auftragsverarbeitung weiter. Im Falle einer gemeinsamen Verarbeitung wird ein Vertrag über gemeinsame Verarbeitung geschlossen.",
    "privacy_policy_withdraw_consent_title": "Widerruf Ihrer Einwilligung zur Datenverarbeitung",
    "privacy_policy_withdraw_consent_text": "Viele Datenverarbeitungsvorgänge sind nur mit Ihrer ausdrücklichen Einwilligung möglich. Sie können eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtmäßigkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unberührt.",
    "privacy_policy_objection_title": "Widerspruchsrecht gegen die Datenerhebung in besonderen Fällen sowie gegen Direktwerbung (Art. 21 DSGVO)",
    "privacy_policy_objection_text1": "WENN DIE DATENVERARBEITUNG AUF GRUNDLAGE VON ART. 6 ABS. 1 LIT. E ODER F DSGVO ERFOLGT, HABEN SIE JEDERZEIT DAS RECHT, AUS GRÜNDEN, DIE SICH AUS IHRER BESONDEREN SITUATION ERGEBEN, GEGEN DIE VERARBEITUNG IHRER PERSONENBEZOGENEN DATEN WIDERSPRUCH EINZULEGEN; DIES GILT AUCH FÜR EIN AUF DIESE BESTIMMUNGEN GESTÜTZTES PROFILING. DIE JEWEILIGE RECHTSGRUNDLAGE, AUF DENEN EINE VERARBEITUNG BERUHT, ENTNEHMEN SIE DIESER DATENSCHUTZERKLÄRUNG. WENN SIE WIDERSPRUCH EINLEGEN, WERDEN WIR IHRE BETROFFENEN PERSONENBEZOGENEN DATEN NICHT MEHR VERARBEITEN, ES SEI DENN, WIR KÖNNEN ZWINGENDE SCHUTZWÜRDIGE GRÜNDE FÜR DIE VERARBEITUNG NACHWEISEN, DIE IHRE INTERESSEN, RECHTE UND FREIHEITEN ÜBERWIEGEN ODER DIE VERARBEITUNG DIENT DER GELTENDMACHUNG, AUSÜBUNG ODER VERTEIDIGUNG VON RECHTSANSPRÜCHEN (WIDERSPRUCH NACH ART. 21 ABS. 1 DSGVO).",
    "privacy_policy_objection_text2": "WERDEN IHRE PERSONENBEZOGENEN DATEN VERARBEITET, UM DIREKTWERBUNG ZU BETREIBEN, SO HABEN SIE DAS RECHT, JEDERZEIT WIDERSPRUCH GEGEN DIE VERARBEITUNG SIE BETREFFENDER PERSONENBEZOGENER DATEN ZUM ZWECKE DERARTIGER WERBUNG EINZULEGEN; DIES GILT AUCH FÜR DAS PROFILING, SOWEIT ES MIT SOLCHER DIREKTWERBUNG IN VERBINDUNG STEHT. WENN SIE WIDERSPRECHEN, WERDEN IHRE PERSONENBEZOGENEN DATEN ANSCHLIESSEND NICHT MEHR ZUM ZWECKE DER DIREKTWERBUNG VERWENDET (WIDERSPRUCH NACH ART. 21 ABS. 2 DSGVO).",
    "privacy_policy_complaint_title": "Beschwerderecht bei der zuständigen Aufsichtsbehörde",
    "privacy_policy_complaint_text": "Im Falle von Verstößen gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer Aufsichtsbehörde, insbesondere in dem Mitgliedstaat ihres gewöhnlichen Aufenthalts, ihres Arbeitsplatzes oder des Orts des mutmaßlichen Verstoßes zu. Das Beschwerderecht besteht unbeschadet anderweitiger verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe.",
    "privacy_policy_data_transfer_title": "Recht auf Datenübertragbarkeit",
    "privacy_policy_data_transfer_text": "Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erfüllung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem gängigen, maschinenlesbaren Format aushändigen zu lassen. Sofern Sie die direkte Übertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist.",
    "privacy_policy_access_correction_deletion_title": "Auskunft, Berichtigung und Löschung",
    "privacy_policy_access_correction_deletion_text": "Sie haben im Rahmen der geltenden gesetzlichen Bestimmungen jederzeit das Recht auf unentgeltliche Auskunft über Ihre gespeicherten personenbezogenen Daten, deren Herkunft und Empfänger und den Zweck der Datenverarbeitung und ggf. ein Recht auf Berichtigung oder Löschung dieser Daten. Hierzu sowie zu weiteren Fragen zum Thema personenbezogene Daten können Sie sich jederzeit an uns wenden.",
    "privacy_policy_restriction_title": "Recht auf Einschränkung der Verarbeitung",
    "privacy_policy_restriction_text1": "Sie haben das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Hierzu können Sie sich jederzeit an uns wenden. Das Recht auf Einschränkung der Verarbeitung besteht in folgenden Fällen:",
    "privacy_policy_restriction_list_item1": "Wenn Sie die Richtigkeit Ihrer bei uns gespeicherten personenbezogenen Daten bestreiten, benötigen wir in der Regel Zeit, um dies zu überprüfen. Für die Dauer der Prüfung haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
    "privacy_policy_restriction_list_item2": "Wenn die Verarbeitung Ihrer personenbezogenen Daten unrechtmäßig geschah/geschieht, können Sie statt der Löschung die Einschränkung der Datenverarbeitung verlangen.",
    "privacy_policy_restriction_list_item3": "Wenn wir Ihre personenbezogenen Daten nicht mehr benötigen, Sie sie jedoch zur Ausübung, Verteidigung oder Geltendmachung von Rechtsansprüchen benötigen, haben Sie das Recht, statt der Löschung die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
    "privacy_policy_restriction_list_item4": "Wenn Sie einen Widerspruch nach Art. 21 Abs. 1 DSGVO eingelegt haben, muss eine Abwägung zwischen Ihren und unseren Interessen vorgenommen werden. Solange noch nicht feststeht, wessen Interessen überwiegen, haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
    "privacy_policy_restriction_text2": "Wenn Sie die Verarbeitung Ihrer personenbezogenen Daten eingeschränkt haben, dürfen diese Daten – von ihrer Speicherung abgesehen – nur mit Ihrer Einwilligung oder zur Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen oder zum Schutz der Rechte einer anderen natürlichen oder juristischen Person oder aus Gründen eines wichtigen öffentlichen Interesses der Europäischen Union oder eines Mitgliedstaats verarbeitet werden.",
    "documentation_title": "Dokumentation",
    "documentation_idea_concept_title": "Idee und Grafisches Konzept",
    "documentation_idea_concept_text": "Meine Webseite wurde entwickelt, um die Fähigkeiten und Projekte als UI/UX-Designer professionell und ansprechend zu präsentieren. Das Hauptziel war es, eine klare, benutzerfreundliche und ästhetisch ansprechende Plattform zu schaffen, die die Kreativität und Kompetenz im Bereich Webdesign widerspiegelt. Die Gestaltung sollte modern, minimalistisch und funktional sein, um den Fokus auf die Inhalte zu legen und eine intuitive Navigation zu ermöglichen.",
    "documentation_styletiles_title": "Styletiles",
    "documentation_styletiles_selection_text": "<strong>Auswahl des Styletiles mit Begründung:</strong> Für das Styletile haben wir eine Kombination aus dunklen und hellen Farben gewählt, um einen starken visuellen Kontrast zu erzeugen. Dies hilft, wichtige Informationen hervorzuheben und die Lesbarkeit zu verbessern. Die Hauptfarben sind ein tiefes Schwarz (#111111) für den Hintergrund, begleitet von Akzenten in Weiß (#eee9e1) und kräftigen Farben wie Grün (#90d491) und Lila (#a196df) für Text und Call-to-Action-Elemente. Diese Farbauswahl spiegelt Leonids kreative und dynamische Persönlichkeit wider.",
    "documentation_styletiles_changes_text": "<strong>Veränderungen gegenüber dem ersten Entwurfsschritt mit Begründung:</strong> Im ersten Entwurf haben wir mehr Farben und verschiedene Schriftarten ausprobiert, was jedoch zu einem überladenen und unruhigen Erscheinungsbild führte. Daher haben wir die Farbpalette vereinfacht und die Anzahl der verwendeten Schriftarten auf zwei reduziert, um ein kohärenteres und professionelleres Design zu erreichen.",
    "documentation_styletile_link_1": "Link zum ersten Style-Tile",
    "documentation_styletile_link_2": "Link zum zweiten Style-Tile",
    "documentation_styletile_link_3": "Link zum dritten Style-Tile",
    "documentation_typography_colors_layout_title": "Typografie, Farben, Layout und Raster",
    "documentation_typography_text": "<strong>Überlegungen zur Typografie:</strong> Die Typografie spielt eine entscheidende Rolle bei der Gestaltung unserer Webseite. Wir haben zwei Hauptschriftarten gewählt: „HANSON“ für Überschriften und „Montserrat“ für Fließtexte. Diese Kombination sorgt für eine klare Hierarchie und gute Lesbarkeit. „HANSON“ vermittelt Stärke und Ausdruckskraft, während „Montserrat“ durch seine Schlichtheit und Vielseitigkeit besticht.",
    "documentation_colors_text": "<strong>Überlegungen zu Farben:</strong> Die Farben wurden sorgfältig ausgewählt, um Kontraste zu schaffen und wichtige Elemente hervorzuheben. Schwarz als Hintergrundfarbe verleiht der Seite Tiefe und Professionalität. Die Akzentfarben Grün und Lila sorgen für frische und kreative Akzente. Weiß wird verwendet, um Texte und wichtige Informationen klar und lesbar zu machen. Die Farben wurden außerdem mit Contrast-Grid geprüft, um sicherzustellen, dass sie ausreichend Kontrast für eine gute Lesbarkeit bieten. Das Contrast-Grid kann <a id='documentation__link-color' href='https://ibb.co/2cbGg3f'>hier</a> eingesehen werden.",
    "documentation_layout_grid_text": "<strong>Überlegungen zu Layout und Raster:</strong> Das Layout der Webseite basiert auf einem flexiblen Grid-System, das eine einfache Anpassung an verschiedene Bildschirmgrößen ermöglicht. Das Raster sorgt für eine klare Struktur und Ordnung, was die Benutzerführung erleichtert. Die Anordnung der Elemente folgt einem visuellen Fluss, der den Nutzer intuitiv durch die Inhalte führt.",
    "documentation_responsive_webdesign_title": "Responsive Webdesign",
    "documentation_responsive_webdesign_text": "<strong>Überlegungen zum Responsive Webdesign und dessen Umsetzung:</strong> Responsive Webdesign war von Anfang an ein zentraler Aspekt unserer Gestaltung. Wir haben sichergestellt, dass die Webseite auf verschiedenen Geräten und Bildschirmgrößen gut funktioniert. Das Design ist „mobile-first“ gestaltet, was bedeutet, dass die mobile Version als Basis dient und für größere Bildschirme erweitert wird. Media Queries wurden verwendet, um Layout-Anpassungen je nach Bildschirmgröße vorzunehmen. Elemente wie Navigation, Bilder und Textblöcke passen sich dynamisch an, um eine optimale Benutzererfahrung zu gewährleisten.",
    "kolophon_title": "Kolophon",
    "kolophon_project_info_title": "Projektname",
    "kolophon_project_info_text": "Leonid Domahalskyy Portfolio",
    "kolophon_texts_title": "Texte",
    "kolophon_project_description": "Projektbeschreibung",
    "kolophon_self_created": "selbsterstellt",
    "kolophon_biography": "Biographie",
    "kolophon_media_title": "Abbildungen etc",
    "kolophon_video": "Video",
    "kolophon_video_source": "Von",
    "kolophon_video_link": "Wannathis: Loops 3D Abstract Animation Kit",
    "kolophon_icons": "Icons",
    "kolophon_icons_source": "Von",
    "kolophon_icons_link": "Flaticon",
    "kolophon_fonts_title": "Schriften",
    "kolophon_font_montserrat": "Montserrat",
    "kolophon_font_link_montserrat": "https://fonts.google.com/specimen/Montserrat",
    "kolophon_font_hanson": "HANSON",
    "kolophon_font_link_hanson": "https://befonts.com/hanson-bold-font.html",
    "kolophon_inspiration_title": "Inspiration",
    "kolophon_inspiration_link_1": "Tomas Hustoles",
    "kolophon_inspiration_link_2": "Wannathis",
    "timeline_title": "Zeitleiste",
    "timeline_project_start": "Projektstart",
    "timeline_project_start_text": "Projektstart und Planung. Wir haben die Anforderungen und Ziele des Projekts definiert und die Struktur der Webseite entworfen. Dabei haben wir uns für ein modernes und responsives Design entschieden, das auf CSS Grid und Flexbox basiert. Die Webseite soll eine klare und übersichtliche Struktur haben und auf allen Geräten optimal dargestellt werden.",
    "timeline_project_start_figcaption1": "Erstes Layout der Startseite mit Grundstruktur und Farbwahl im Light- und Darkmode für Smartphone, Tablet und Desktop Auflösungen.",
    "timeline_project_start_figcaption2": "Erstes Layout der „Über mich“-Seite.",
    "timeline_project_start_figcaption3": "Erstes Layout der „Kontakt“-Seite.",
    "timeline_project_start_figcaption4": "Erstes Layout der „Projekte“-Seite.",
    "timeline_typography": "Typografie",
    "timeline_typography_text": "Auswahl und Integration von Schriftarten. Wir haben die Schriftarten Hanson und Montserrat als @font-face in die CSS-Datei eingebunden. Dabei wurden die Fonts in den Formaten .woff und .woff2 eingebunden. Font-display wurde auf swap gesetzt, um die Texte so schnell wie möglich anzuzeigen.",
    "timeline_typography_figcaption": "Übersicht über die Schriftarten im Fonts-Ordner.",
    "timeline_reset_css": "Reset CSS und CSS-Variablen",
    "timeline_reset_css_text": "Implementierung von Reset CSS und CSS-Variablen. Wir haben zunächst ein Reset-CSS eingeführt, um eine konsistente Basis für alle Browser zu schaffen. Anschließend wurden CSS-Variablen definiert, um Farben, Schriftgrößen und Abstände zentral zu verwalten und eine einfache Wartung und Anpassung des Designs zu ermöglichen.",
    "timeline_reset_css_figcaption": "Eine Übersicht über die Reset-CSS-Datei und die definierten CSS-Variablen.",
    "timeline_reset_css_figcaption2": "Die CSS-Variablen wurden im :root-Element definiert, um sie im gesamten Stylesheet zu verwenden. Die Variablen wurden für Farben, Schriftgrößen, Schriftarten, Schriftgewichte, Abstände und Animationen definiert.",
    "timeline_first_implementation": "Erste Implementierung",
    "timeline_first_implementation_text": "Erste Implementierung des Layouts und der Navigation. Wir haben die Grundstruktur der Webseite erstellt, inklusive Hauptnavigation, Header und Hauptinhaltsbereich. Die Entwicklung begann mit der mobilen Auflösung und wurde für größere Bildschirme erweitert. Dabei kam CSS Grid zum Einsatz, um eine flexible und anpassungsfähige Struktur zu gewährleisten.",
    "timeline_first_implementation_figcaption1": "Die mobile Version des Headers und der Navigation.",
    "timeline_first_implementation_figcaption2": "Die Desktop Version des Headers und der Navigation.",
    "timeline_main_content": "Umsetzung des Hauptinhalts",
    "timeline_main_content_text": "Umsetzung des Hauptinhalts und der Projekte. Die Projekte wurden in einer Grid-Struktur angeordnet, um eine übersichtliche Darstellung zu gewährleisten. Dabei wurden die Projekte in einer oder mehreren Spalten angezeigt, abhängig von der Bildschirmgröße des Geräts.",
    "timeline_main_content_figcaption1": "Die mobile Version des Mainbereichs. Im Inspektor ist die Grid-Struktur zu sehen.",
    "timeline_main_content_figcaption2": "Auf mobilen Geräten wird ein Projekt pro Zeile angezeigt, auf größeren Bildschirmen zwei oder drei Projekte pro Zeile.",
    "timeline_main_content_figcaption3": "Die Tablet-Version des Mainbereichs. Die Projekte werden in 2 Spalten angezeigt.",
    "timeline_main_content_figcaption4": "Die Desktop Version des Mainbereichs. Die Projekte werden in 3 Spalten angezeigt.",
    "timeline_footer": "Implementierung des Footers",
    "timeline_footer_text": "Der Footer wurde in mehrere Abschnitte unterteilt, darunter soziale Medien, rechtliche Informationen und Kontaktinformationen. Dabei wurde Flexbox verwendet, um die Elemente zu positionieren und zu stylen. Die Listen wurden zentriert und mit einem Hover-Effekt versehen.",
    "timeline_footer_figcaption": "Der Footer mit sozialen Medien, rechtlichen Informationen und Kontaktinformationen.",
    "timeline_footer_figcaption2": "Grid als Hauptlayout für den Footer. Flexbox für die Listen.",
    "timeline_hamburger_menu": "Umsetzung der Funktion des Hamburger Menüs",
    "timeline_hamburger_menu_text": "Die Funktion des Hamburger Menüs wurde mit JavaScript umgesetzt. Beim Klick auf das Hamburger Menü wird die Navigation eingeblendet und das Hamburger Menü wird animiert. Beim Klick auf einen Navigationslink wird das Hamburger Menü geschlossen. Mit der Escape-Taste kann das Hamburger Menü ebenfalls geschlossen werden.",
    "timeline_hamburger_menu_figcaption": "Der JavaScript-Code für das Hamburger Menü.",
    "timeline_about_me": "Die Über mich Seite",
    "timeline_about_me_text": "Beim Meine Fähigkeiten Bereich auf der Über mich Seite wurde wieder Grid benutzt für das Grundlayout. Für die einzelnen Level wurde Flexbox benutzt. Die Seite wurde responsiv gestaltet.",
    "timeline_about_me_figcaption": "Übersicht der Fähigkeiten auf der Über mich Seite.",
    "timeline_contact_form": "Kontaktformular",
    "timeline_contact_form_text": "Das Kontaktformular wurde mit Grid erstellt. Die einzelnen Felder wurden mit Flexbox gestaltet. Alle Inputs wurden mit Labels verknüpft. Das Aussehen von textarea und input wurde mit CSS angepasst. Die Seite wurde ebenfalls responsiv gestaltet.",
    "timeline_contact_form_figcaption": "Das Kontaktformular mit den Feldern Name, E-Mail, Betreff und Nachricht.",
    "timeline_testing_phase": "Testphase und Anpassungen",
    "timeline_testing_phase_text": "In der Testphase wurden alle Funktionen und Inhalte überprüft und Anpassungen vorgenommen. Dabei wurde die Webseite auf verschiedenen Geräten und Browsern getestet, um eine optimale Darstellung und Funktionalität zu gewährleisten. Angefangen bei einer Auflösung von 320px bis 1920px. Die Webseite wurde auf Chrome, Firefox, Safari und Edge getestet. Dabei wurden die Inhalte und die Navigation überprüft und gegebenenfalls angepasst.",
    "timeline_finalization": "Finalisierung",
    "timeline_finalization_text": "Die Webseite wurde finalisiert und für die Abgabe vorbereitet. Dabei wurden die letzten Anpassungen vorgenommen, um die Performance zu optimieren. Die Webseite wurde bei einem Webhoster hochgeladen und getestet, um sicherzustellen, dass alles reibungslos funktioniert. Die JPG-Bilder wurden durch WebP-Bilder ersetzt, die zusätzlich komprimiert wurden. Die Webseite wurde auf Google PageSpeed getestet und mit dem W3C Validator überprüft. Die CSS-Datei wurde minifiziert. Es wurden die Dateien robots.txt und sitemap.xml erstellt.",
    "timeline_finalization_figcaption1": "Ergebnis von Google PageSpeed.",
    "timeline_finalization_figcaption2": "Ergebnis von Contrast-Grid.",
    "timeline_nav_project_start": "Projektstart",
    "timeline_nav_typography": "Typografie",
    "timeline_nav_reset_css": "Reset CSS und CSS-Variablen",
    "timeline_nav_first_implementation": "Erste Implementierung",
    "timeline_nav_main_content": "Hauptinhalt",
    "timeline_nav_footer": "Footer",
    "timeline_nav_hamburger_menu": "Hamburgermenü",
    "timeline_nav_about_me": "Über mich Seite",
    "timeline_nav_contact_form": "Kontaktformular",
    "timeline_nav_testing_phase": "Testphase",
    "timeline_nav_finalization": "Finalisierung"
}
