{
    "nav_projects": "Projects",
    "nav_about": "About",
    "nav_contact": "Contact",
    "header_title": "Hey<br />I am Leonid",
    "projects_title": "Projects",
    "contact_title": "Contact",
    "contact_vorname_label": "First Name",
    "contact_nachname_label": "Last Name",
    "contact_email_label": "Email",
    "contact_message_label": "Message",
    "contact_submit_button": "Submit",
    "contact_info_title": "Let's talk about <span>projects</span>.",
    "contact_info_text": "I am excited about your ideas and look forward to working with you. Just send me a message and I will get back to you.",
    "about_title": "About Me",
    "about_headline": "About Me",
    "about_intro": "Hi! I am a passionate programmer from Flensburg in the north of Germany. I have gained my knowledge in software development through continuous engagement, practical experiences, and my studies in <span>Media Informatics</span> at the University of Applied Sciences Flensburg.",
    "about_study_field": "Media Informatics",
    "about_passion": "I have a special passion for developing web applications, especially in the field of <span>UI/UX Design</span> and <span>Web Development</span>. It is important to me that solutions are not only functional but also user-friendly. Innovation and usability are my constant motivation.",
    "about_ui_ux": "UI/UX Design",
    "about_web_dev": "Web Development",
    "about_skills": "I always stay updated with the latest technologies to ensure that my skills meet current requirements. If you are looking for a skilled developer who delivers outstanding results, I am at your service.",
    "about_collaboration": "Let's work together on exciting projects and create great digital experiences. Contact me to learn more about my work and how I can help you.",
    "capabilities_headline": "My Capabilities",
    "capabilities_languages_headline": "Languages",
    "language_german": "German",
    "language_russian": "Russian",
    "language_ukrainian": "Ukrainian",
    "language_english": "English",
    "level_c2": "C2",
    "level_native": "Native",
    "level_b1": "B1",
    "capabilities_programming_languages_headline": "Programming Languages",
    "language_javascript": "JavaScript",
    "language_java": "Java",
    "language_kotlin": "Kotlin",
    "language_python": "Python",
    "level_proficient": "Proficient",
    "level_advanced": "Advanced",
    "level_beginner": "Beginner",
    "capabilities_web_dev_headline": "Web Development",
    "language_react": "React",
    "language_nodejs": "Node.js",
    "language_deno": "Deno",
    "capabilities_design_headline": "Design",
    "language_webdesign": "Web Design",
    "language_uidesign": "UI Design",
    "social_telegram": "Link to my Telegram channel.",
    "social_discord": "Link to my Discord server.",
    "social_dribbble": "Link to my Dribbble profile.",
    "social_github": "Link to my GitHub repository.",
    "social_linkedin": "Link to my LinkedIn profile.",
    "legal_imprint": "Imprint",
    "legal_privacy": "Privacy Policy",
    "legal_documentation": "Documentation",
    "legal_colophon": "Colophon",
    "legal_timeline": "Timeline",
    "project_name_dance_academy": "Angela's Dance Academy",
    "project_description_dance_academy": "Visual Identity, Branding, Logotype, Website",
    "project_text_dance_academy": "In this project, I utilized my skills in HTML and CSS to develop a dynamic and engaging website for Angela's Dance Academy. The website is designed to showcase the passion and talent for dance in a unique way.",
    "project_keywords_dance_academy": "HTML, CSS, Responsive Design",
    "project_images_heading": "Image Gallery",
    "project_thumbnail_alt_dance_academy": "Header of Angela's Dance Academy website featuring the academy's logo and contact information. The address is 12840 Tamiami Trail North Suite 300, Naples, FL, 34110, and the phone number is 239.215.2888.",
    "project_gif_alt_dance_academy": "GIF of Angela's Dance Academy website scrolling from top to bottom showing various sections.",
    "project_logo_alt_dance_academy": "Logo of Angela's Dance Academy with a stylized letter 'A' and the text 'Angela's Dance Academy' next to it.",
    "project_mobile_screenshot_alt_dance_academy": "Screenshot of Angela's Dance Academy website on a smartphone. The mobile view shows the homepage with an image of dancing children and a short description below.",
    "project_desktop_screenshot_alt_dance_academy": "Screenshot of Angela's Dance Academy website on a laptop. The desktop view shows the courses page, including images of dancing children and course descriptions.",
    "project_name_audiventure": "Audiventure",
    "project_description_audiventure": "Visual Identity, Branding, Logo of the Click Dummy",
    "project_text_audiventure": "An interactive click dummy for an audio drama player, developed as part of a university project in the 'Interface and Interaction Design' module at the University of Applied Sciences Flensburg. The click dummy was created as a visual concept that conveys the user interface and interaction with the player.",
    "project_keywords_audiventure": "UX, UI, Figma, Design Thinking",
    "project_thumbnail_alt_audiventure": "Screenshot of the Audiventure app showing all frames of the app, including the home page, search page, library view, trophy view, book detail pages, settings, and payment options. The app frames are displayed on a smartphone screen, providing a comprehensive overview of the app's design and features.",
    "project_gif_alt_audiventure": "Screenshot of the Audiventure app showing a carousel running from left to right, displaying various screens of the app. The home page, search page, library view, trophy view, book detail pages, settings, and payment options can be seen. The app frames are displayed on a smartphone screen, providing a comprehensive overview of the app's design and features.",
    "project_detail_alt_audiventure": "Screenshot of the Audiventure app showing the detail view of the audio player on a smartphone. The book 'Hobbit' by Ed Strauss is displayed. The book cover is at the top, followed by the title, author, and a short description. A play button is located at the bottom right.",
    "project_search_alt_audiventure": "Screenshot of the Audiventure app search page on a smartphone. At the top is a search bar with the text 'Search'. Below are several book covers in a grid layout. Each book cover has a title underneath. The app interface is dark with white text.",
    "project_home_alt_audiventure": "Screenshot of the Audiventure app home page on a smartphone, showing a large pink banner with the app name 'Audiventure'. Below is the slogan 'Where reading becomes everyday, and stories come to life'. At the bottom is a pink button with the text 'Let's go!'",
    "project_name_pw_generator": "Password Generator",
    "project_description_pw_generator": "Website",
    "project_text_pw_generator": "The Password Generator allows the creation of secure passwords by selecting length and various character types. Users can choose the desired settings and generate a strong password. The website was developed using HTML, CSS, and JavaScript.",
    "project_keywords_pw_generator": "HTML, CSS, JavaScript",
    "project_image_alt_pw_generator": "A clip of the Password Generator in action in the web browser",
    "project_name_photography_masterclass": "Photography Masterclass",
    "project_description_photography_masterclass": "CSS/SCSS Course",
    "project_text_photography_masterclass": "In the course 'Advanced CSS: Modern Techniques for Websites', I expanded my knowledge in HTML and CSS. The course provided a hands-on introduction to modern CSS3 features that enable the development of interactive websites.",
    "project_keywords_photography_masterclass": "Responsive Design, Gradients, Animations, BEM, Flexbox, Grid, SCSS",
    "project_thumbnail_alt_photography_masterclass": "Screenshot of the photography tour website titled 'Our Photography Tours'. It shows five different tour offers: 'Desert Tour' in Bateen Liwa, UAE, 'Drone Photography' in Porvoo, Finland, 'Mountaineering Tours' in Montreal, Canada, 'Ice Hikes' in Nuuk, Greenland, and 'Polar Bear Photography' in Antarctica. Each offer has an image and a short description of the location.",
    "project_frame1_alt_photography_masterclass": "Screenshot of the Photography Masterclass website on a laptop. The homepage shows a large background image of a landscape with the title 'Photography Masterclass' and the subtitle 'Master Landscape Photography in 10 Days'.",
    "project_frame2_alt_photography_masterclass": "Screenshot of the Photography Masterclass website showing three course offers: 'Landscape Quick Course', 'Portrait Basics Course', and 'Portrait Pro Course'. Each offer has an image, a short description, the duration, and the price.",
    "project_frame3_alt_photography_masterclass": "Screenshot of the Photography Masterclass website showing various landscape images. The text next to it describes the benefits of the landscape photography course.",
    "project_frame4_alt_photography_masterclass": "Screenshot of the Photography Masterclass website on a smartphone. The mobile view shows the homepage with the title 'Photography Masterclass' and the subtitle 'Master Landscape Photography in 10 Days'. Below is a description of the course.",
    "imprint_title": "Imprint",
    "imprint_contact": "Contact",
    "privacy_policy_title": "Privacy Policy",
    "privacy_policy_overview_title": "1. Privacy at a Glance",
    "privacy_policy_general_info_title": "General Information",
    "privacy_policy_general_info_text": "The following notes provide a simple overview of what happens to your personal data when you visit this website. Personal data are all data with which you can be personally identified. Detailed information on the subject of data protection can be found in our privacy policy listed below this text.",
    "privacy_policy_data_collection_title": "Data Collection on this Website",
    "privacy_policy_responsible_title": "Who is responsible for data collection on this website?",
    "privacy_policy_responsible_text": "The data processing on this website is carried out by the website operator. The operator's contact details can be found in the 'Notice concerning the responsible party' section of this privacy policy.",
    "privacy_policy_how_collect_title": "How do we collect your data?",
    "privacy_policy_how_collect_text1": "Your data will be collected when you provide it to us. This can be, for example, data that you enter in a contact form.",
    "privacy_policy_how_collect_text2": "Other data are collected automatically or with your consent when you visit the website by our IT systems. These are mainly technical data (e.g. internet browser, operating system, or time of the page visit). The collection of this data takes place automatically as soon as you enter this website.",
    "privacy_policy_use_data_title": "What do we use your data for?",
    "privacy_policy_use_data_text": "Part of the data is collected to ensure the website is provided without errors. Other data can be used to analyze your user behavior.",
    "privacy_policy_rights_title": "What rights do you have regarding your data?",
    "privacy_policy_rights_text1": "You have the right at any time to obtain information about the origin, recipient, and purpose of your stored personal data free of charge. You also have the right to request the correction or deletion of this data. If you have given your consent to data processing, you can withdraw this consent at any time for the future. You also have the right, under certain circumstances, to request the restriction of the processing of your personal data. Furthermore, you have the right to lodge a complaint with the competent supervisory authority.",
    "privacy_policy_rights_text2": "For this, as well as for further questions about data protection, you can contact us at any time.",
    "privacy_policy_hosting_title": "2. Hosting",
    "privacy_policy_hosting_text": "We host the content of our website with the following provider:",
    "privacy_policy_provider_title": "Strato",
    "privacy_policy_provider_text1": "The provider is Strato AG, Otto-Ostrowski-Straße 7, 10249 Berlin (hereinafter 'Strato'). When you visit our website, Strato collects various log files including your IP addresses.",
    "privacy_policy_provider_text2": "For more information, please see Strato's privacy policy: <a href=\"https://www.strato.de/datenschutz/\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.strato.de/datenschutz/</a>.",
    "privacy_policy_provider_text3": "The use of Strato is based on Art. 6 para. 1 lit. f DSGVO. We have a legitimate interest in the most reliable presentation of our website. If the corresponding consent has been requested, the processing is carried out exclusively on the basis of Art. 6 para. 1 lit. a DSGVO and § 25 para. 1 TDDDG, insofar as the consent includes the storage of cookies or access to information on the user's device (e.g. device fingerprinting) within the meaning of the TDDDG. The consent can be revoked at any time.",
    "privacy_policy_general_info2_title": "3. General Information and Mandatory Information",
    "privacy_policy_data_protection_title": "Data Protection",
    "privacy_policy_data_protection_text1": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this privacy policy.",
    "privacy_policy_data_protection_text2": "When you use this website, various personal data are collected. Personal data are data with which you can be personally identified. This privacy policy explains what data we collect and what we use it for. It also explains how and for what purpose this happens.",
    "privacy_policy_data_protection_text3": "We would like to point out that data transmission over the Internet (e.g. when communicating by email) can have security gaps. A complete protection of the data against access by third parties is not possible.",
    "privacy_policy_responsible_info_title": "Notice concerning the responsible party",
    "privacy_policy_responsible_info_text1": "The responsible party for data processing on this website is:",
    "privacy_policy_address": "Leonid Domahalskyy<br />Rude 13<br />24941 Flensburg<br />Phone: 015205892880<br />Email: <a href=\"mailto:leonid.domagalsky@gmail.com\">leonid.domagalsky@gmail.com</a>",
    "privacy_policy_responsible_info_text2": "The responsible party is the natural or legal person who alone or jointly with others determines the purposes and means of the processing of personal data (e.g. names, email addresses, etc.).",
    "privacy_policy_storage_duration_title": "Storage Duration",
    "privacy_policy_storage_duration_text": "Unless a more specific storage period has been stated within this privacy policy, your personal data will remain with us until the purpose for the data processing ceases to apply. If you assert a legitimate request for deletion or withdraw your consent to data processing, your data will be deleted, unless we have other legally permissible reasons for storing your personal data (e.g. retention periods under tax or commercial law); in the latter case, deletion will take place after these reasons cease to apply.",
    "privacy_policy_legal_basis_title": "General Information on the Legal Bases of Data Processing on this Website",
    "privacy_policy_legal_basis_text": "If you have consented to data processing, we process your personal data on the basis of Art. 6 para. 1 lit. a DSGVO or Art. 9 para. 2 lit. a DSGVO if special data categories according to Art. 9 para. 1 DSGVO are processed. In the case of an explicit consent to the transfer of personal data to third countries, the data processing is also based on Art. 49 para. 1 lit. a DSGVO. If you have consented to the storage of cookies or to the access to information on your end device (e.g. via device fingerprinting), the data processing is additionally carried out on the basis of § 25 para. 1 TDDDG. The consent can be revoked at any time. If your data is required for the performance of a contract or for the implementation of pre-contractual measures, we process your data on the basis of Art. 6 para. 1 lit. b DSGVO. Furthermore, we process your data if it is necessary to fulfill a legal obligation on the basis of Art. 6 para. 1 lit. c DSGVO. The data processing can also be based on our legitimate interest according to Art. 6 para. 1 lit. f DSGVO. Information on the relevant legal bases in each individual case can be found in the following paragraphs of this privacy policy.",
    "privacy_policy_recipients_title": "Recipients of Personal Data",
    "privacy_policy_recipients_text": "In the course of our business activities, we cooperate with various external bodies. In some cases, the transmission of personal data to these external bodies is also required. We only pass on personal data to external bodies if this is necessary within the scope of contract fulfillment, if we are legally obliged to do so (e.g. transfer of data to tax authorities), if we have a legitimate interest according to Art. 6 para. 1 lit. f DSGVO in the transfer, or if another legal basis allows the data transfer. When using processors, we only pass on personal data of our customers on the basis of a valid processing contract. In the case of joint processing, a joint processing contract is concluded.",
    "privacy_policy_withdraw_consent_title": "Revocation of Your Consent to Data Processing",
    "privacy_policy_withdraw_consent_text": "Many data processing operations are only possible with your explicit consent. You can revoke consent that has already been given at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "privacy_policy_objection_title": "Right to Object to Data Collection in Special Cases and to Direct Advertising (Art. 21 DSGVO)",
    "privacy_policy_objection_text1": "IF DATA PROCESSING IS BASED ON ART. 6 PARA. 1 LIT. E OR F DSGVO, YOU HAVE THE RIGHT TO OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA AT ANY TIME FOR REASONS ARISING FROM YOUR PARTICULAR SITUATION; THIS ALSO APPLIES TO PROFILING BASED ON THESE PROVISIONS. THE RESPECTIVE LEGAL BASIS ON WHICH PROCESSING IS BASED CAN BE FOUND IN THIS PRIVACY POLICY. IF YOU OBJECT, WE WILL NO LONGER PROCESS YOUR PERSONAL DATA UNLESS WE CAN DEMONSTRATE COMPELLING LEGITIMATE GROUNDS FOR THE PROCESSING WHICH OVERRIDE YOUR INTERESTS, RIGHTS, AND FREEDOMS, OR THE PROCESSING SERVES TO ASSERT, EXERCISE, OR DEFEND LEGAL CLAIMS (OBJECTION ACCORDING TO ART. 21 PARA. 1 DSGVO).",
    "privacy_policy_objection_text2": "IF YOUR PERSONAL DATA IS PROCESSED FOR DIRECT MARKETING PURPOSES, YOU HAVE THE RIGHT TO OBJECT AT ANY TIME TO THE PROCESSING OF YOUR PERSONAL DATA FOR THE PURPOSE OF SUCH MARKETING; THIS ALSO APPLIES TO PROFILING, INSOFAR AS IT IS RELATED TO SUCH DIRECT MARKETING. IF YOU OBJECT, YOUR PERSONAL DATA WILL SUBSEQUENTLY NO LONGER BE USED FOR DIRECT MARKETING PURPOSES (OBJECTION ACCORDING TO ART. 21 PARA. 2 DSGVO).",
    "privacy_policy_complaint_title": "Right to Lodge a Complaint with the Competent Supervisory Authority",
    "privacy_policy_complaint_text": "In the event of violations of the DSGVO, data subjects have the right to lodge a complaint with a supervisory authority, in particular in the member state of their habitual residence, their place of work, or the place of the alleged violation. The right to lodge a complaint is without prejudice to other administrative or judicial remedies.",
    "privacy_policy_data_transfer_title": "Right to Data Portability",
    "privacy_policy_data_transfer_text": "You have the right to have data that we process automatically on the basis of your consent or in fulfillment of a contract handed over to you or to a third party in a common, machine-readable format. If you request the direct transfer of the data to another responsible party, this will only be done to the extent that it is technically feasible.",
    "privacy_policy_access_correction_deletion_title": "Right to Information, Correction, and Deletion",
    "privacy_policy_access_correction_deletion_text": "Within the scope of the applicable legal provisions, you have the right at any time to obtain information about your stored personal data, their origin and recipient, and the purpose of the data processing and, if necessary, a right to correct or delete this data. For this purpose, as well as for further questions on the subject of personal data, you can contact us at any time.",
    "privacy_policy_restriction_title": "Right to Restriction of Processing",
    "privacy_policy_restriction_text1": "You have the right to request the restriction of the processing of your personal data. For this purpose, you can contact us at any time. The right to restriction of processing exists in the following cases:",
    "privacy_policy_restriction_list_item1": "If you dispute the accuracy of your personal data stored with us, we usually need time to verify this. For the duration of the verification, you have the right to request the restriction of the processing of your personal data.",
    "privacy_policy_restriction_list_item2": "If the processing of your personal data happened/ happens unlawfully, you can request the restriction of data processing instead of deletion.",
    "privacy_policy_restriction_list_item3": "If we no longer need your personal data, but you need them to exercise, defend, or assert legal claims, you have the right to request the restriction of the processing of your personal data instead of deletion.",
    "privacy_policy_restriction_list_item4": "If you have lodged an objection under Art. 21 para. 1 DSGVO, a balance must be struck between your interests and ours. As long as it is not yet clear whose interests outweigh the others, you have the right to request the restriction of the processing of your personal data.",
    "privacy_policy_restriction_text2": "If you have restricted the processing of your personal data, this data - apart from being stored - may only be processed with your consent or for the assertion, exercise, or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of important public interest of the European Union or a member state.",
    "documentation_title": "Documentation",
    "documentation_idea_concept_title": "Idea and Graphic Concept",
    "documentation_idea_concept_text": "My website was developed to professionally and attractively present the skills and projects as a UI/UX designer. The main goal was to create a clear, user-friendly, and aesthetically pleasing platform that reflects creativity and competence in web design. The design should be modern, minimalist, and functional to focus on content and enable intuitive navigation.",
    "documentation_styletiles_title": "Styletiles",
    "documentation_styletiles_selection_text": "<strong>Selection of the styletile with justification:</strong> For the styletile, we chose a combination of dark and light colors to create strong visual contrast. This helps to highlight important information and improve readability. The main colors are a deep black (#111111) for the background, accompanied by accents in white (#eee9e1) and bold colors such as green (#90d491) and purple (#a196df) for text and call-to-action elements. This color choice reflects Leonid's creative and dynamic personality.",
    "documentation_styletiles_changes_text": "<strong>Changes from the first draft step with justification:</strong> In the first draft, we tried more colors and different fonts, but this led to a cluttered and restless appearance. Therefore, we simplified the color palette and reduced the number of fonts used to two to achieve a more coherent and professional design.",
    "documentation_styletile_link_1": "Link to the first style-tile",
    "documentation_styletile_link_2": "Link to the second style-tile",
    "documentation_styletile_link_3": "Link to the third style-tile",
    "documentation_typography_colors_layout_title": "Typography, Colors, Layout, and Grid",
    "documentation_typography_text": "<strong>Considerations for typography:</strong> Typography plays a crucial role in the design of our website. We chose two main fonts: 'HANSON' for headings and 'Montserrat' for body text. This combination provides clear hierarchy and good readability. 'HANSON' conveys strength and expressiveness, while 'Montserrat' impresses with its simplicity and versatility.",
    "documentation_colors_text": "<strong>Considerations for colors:</strong> Colors were carefully selected to create contrasts and highlight important elements. Black as a background color gives the site depth and professionalism. The accent colors green and purple provide fresh and creative accents. White is used to make texts and important information clear and readable. The colors were also checked with Contrast-Grid to ensure they provide enough contrast for good readability. The contrast grid can be viewed <a id='documentation__link-color' href='https://ibb.co/2cbGg3f'>here</a>.",
    "documentation_layout_grid_text": "<strong>Considerations for layout and grid:</strong> The layout of the website is based on a flexible grid system that allows easy adaptation to different screen sizes. The grid provides clear structure and order, which facilitates user guidance. The arrangement of elements follows a visual flow that intuitively guides the user through the content.",
    "documentation_responsive_webdesign_title": "Responsive Web Design",
    "documentation_responsive_webdesign_text": "<strong>Considerations for responsive web design and its implementation:</strong> Responsive web design has been a central aspect of our design from the start. We ensured that the website works well on various devices and screen sizes. The design is 'mobile-first', which means the mobile version serves as the basis and is expanded for larger screens. Media queries were used to make layout adjustments depending on screen size. Elements such as navigation, images, and text blocks dynamically adapt to ensure an optimal user experience.",
    "kolophon_title": "Colophon",
    "kolophon_project_info_title": "Project Name",
    "kolophon_project_info_text": "Leonid Domahalskyy Portfolio",
    "kolophon_texts_title": "Texts",
    "kolophon_project_description": "Project Description",
    "kolophon_self_created": "self-created",
    "kolophon_biography": "Biography",
    "kolophon_media_title": "Images etc",
    "kolophon_video": "Video",
    "kolophon_video_source": "From",
    "kolophon_video_link": "Wannathis: Loops 3D Abstract Animation Kit",
    "kolophon_icons": "Icons",
    "kolophon_icons_source": "From",
    "kolophon_icons_link": "Flaticon",
    "kolophon_fonts_title": "Fonts",
    "kolophon_font_montserrat": "Montserrat",
    "kolophon_font_link_montserrat": "https://fonts.google.com/specimen/Montserrat",
    "kolophon_font_hanson": "HANSON",
    "kolophon_font_link_hanson": "https://befonts.com/hanson-bold-font.html",
    "kolophon_inspiration_title": "Inspiration",
    "kolophon_inspiration_link_1": "Tomas Hustoles",
    "kolophon_inspiration_link_2": "Wannathis",
    "timeline_project_start": "Project Start",
    "timeline_title": "Timeline",
    "timeline_project_start_text": "Project start and planning. We defined the requirements and goals of the project and designed the structure of the website. We decided on a modern and responsive design based on CSS Grid and Flexbox. The website should have a clear and concise structure and be optimally displayed on all devices.",
    "timeline_project_start_figcaption1": "First layout of the homepage with basic structure and color selection in light and dark mode for smartphone, tablet, and desktop resolutions.",
    "timeline_project_start_figcaption2": "First layout of the 'About Me' page.",
    "timeline_project_start_figcaption3": "First layout of the 'Contact' page.",
    "timeline_project_start_figcaption4": "First layout of the 'Projects' page.",
    "timeline_typography": "Typography",
    "timeline_typography_text": "Selection and integration of fonts. We embedded the fonts Hanson and Montserrat as @font-face in the CSS file. The fonts were embedded in .woff and .woff2 formats. Font-display was set to swap to display the texts as quickly as possible.",
    "timeline_typography_figcaption": "Overview of the fonts in the Fonts folder.",
    "timeline_reset_css": "Reset CSS and CSS Variables",
    "timeline_reset_css_text": "Implementation of Reset CSS and CSS variables. We first introduced a reset CSS to create a consistent base for all browsers. Then CSS variables were defined to centrally manage colors, font sizes, and spacing, enabling easy maintenance and design adjustments.",
    "timeline_reset_css_figcaption": "Overview of the reset CSS file and defined CSS variables.",
    "timeline_reset_css_figcaption2": "CSS variables were defined in the :root element to use them throughout the stylesheet. The variables were defined for colors, font sizes, fonts, font weights, spacing, and animations.",
    "timeline_first_implementation": "First Implementation",
    "timeline_first_implementation_text": "First implementation of the layout and navigation. We created the basic structure of the website, including main navigation, header, and main content area. The development started with the mobile resolution and was extended to larger screens. CSS Grid was used to ensure a flexible and adaptable structure.",
    "timeline_first_implementation_figcaption1": "The mobile version of the header and navigation.",
    "timeline_first_implementation_figcaption2": "The desktop version of the header and navigation.",
    "timeline_main_content": "Implementation of Main Content",
    "timeline_main_content_text": "Implementation of the main content and projects. The projects were arranged in a grid structure to ensure a clear presentation. The projects were displayed in one or more columns depending on the screen size of the device.",
    "timeline_main_content_figcaption1": "The mobile version of the main area. The inspector shows the grid structure.",
    "timeline_main_content_figcaption2": "On mobile devices, one project is displayed per row; on larger screens, two or three projects per row.",
    "timeline_main_content_figcaption3": "The tablet version of the main area. Projects are displayed in two columns.",
    "timeline_main_content_figcaption4": "The desktop version of the main area. Projects are displayed in three columns.",
    "timeline_footer": "Footer Implementation",
    "timeline_footer_text": "The footer was divided into several sections, including social media, legal information, and contact information. Flexbox was used to position and style the elements. The lists were centered and provided with a hover effect.",
    "timeline_footer_figcaption": "The footer with social media, legal information, and contact information.",
    "timeline_footer_figcaption2": "Grid as the main layout for the footer. Flexbox for the lists.",
    "timeline_hamburger_menu": "Implementation of Hamburger Menu",
    "timeline_hamburger_menu_text": "The functionality of the hamburger menu was implemented with JavaScript. When clicking on the hamburger menu, the navigation is displayed and the hamburger menu is animated. When clicking on a navigation link, the hamburger menu closes. The hamburger menu can also be closed with the Escape key.",
    "timeline_hamburger_menu_figcaption": "The JavaScript code for the hamburger menu.",
    "timeline_about_me": "About Me Page",
    "timeline_about_me_text": "For the 'My Skills' section on the 'About Me' page, grid was used for the basic layout. Flexbox was used for the individual levels. The page was designed to be responsive.",
    "timeline_about_me_figcaption": "Overview of the skills on the 'About Me' page.",
    "timeline_contact_form": "Contact Form",
    "timeline_contact_form_text": "The contact form was created using a grid. The individual fields were designed with Flexbox. All inputs were linked to labels. The appearance of textarea and input was customized with CSS. The page was also designed to be responsive.",
    "timeline_contact_form_figcaption": "The contact form with fields for name, email, subject, and message.",
    "timeline_testing_phase": "Testing Phase and Adjustments",
    "timeline_testing_phase_text": "During the testing phase, all functions and content were checked and adjustments were made. The website was tested on various devices and browsers to ensure optimal display and functionality. The website was tested on Chrome, Firefox, Safari, and Edge. Content and navigation were checked and adjusted if necessary.",
    "timeline_finalization": "Finalization",
    "timeline_finalization_text": "The website was finalized and prepared for submission. Final adjustments were made to optimize performance. The website was uploaded to a web host and tested to ensure everything works smoothly. JPG images were replaced with compressed WebP images. The website was tested on Google PageSpeed and validated with the W3C Validator. The CSS file was minified. The files robots.txt and sitemap.xml were created.",
    "timeline_finalization_figcaption1": "Result from Google PageSpeed.",
    "timeline_finalization_figcaption2": "Result from Contrast-Grid.",
    "timeline_nav_project_start": "Project Start",
    "timeline_nav_typography": "Typography",
    "timeline_nav_reset_css": "Reset CSS and CSS Variables",
    "timeline_nav_first_implementation": "First Implementation",
    "timeline_nav_main_content": "Main Content",
    "timeline_nav_footer": "Footer",
    "timeline_nav_hamburger_menu": "Hamburger Menu",
    "timeline_nav_about_me": "About Me Page",
    "timeline_nav_contact_form": "Contact Form",
    "timeline_nav_testing_phase": "Testing Phase",
    "timeline_nav_finalization": "Finalization"
    
}
